_posts/2022-06-18-ideas.html
---
layout: post
title: 胡思乱想
excerpt: 胡思乱想
---
<p>
最近有不少的怪诞想法，在这里记录一下，防止自己忘记，也许其中一部分还能成为现实。
</p>
<div id="outline-container-orgab68735" class="outline-2">
<h2 id="orgab68735"><span class="section-number-2">1.</span> 开源硬件</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org221517d" class="outline-3">
<h3 id="org221517d"><span class="section-number-3">1.1.</span> <span class="todo TODO">TODO</span> <a href="https://github.com/paul356/MK32">基于ESP32-S3的智能键盘 [80%</a>]</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> 支持定制按键keycode</li>
<li class="off"><code>[&#xa0;]</code> 支持定制宏</li>
<li class="on"><code>[X]</code> 支持蓝牙协议、USB</li>
<li class="on"><code>[X]</code> 支持WIFI Station、Soft AP</li>
<li class="on"><code>[X]</code> 使用QMK的matrix和tmk_core替换MK32的matrix,tmk_core</li>
</ul>
</div>
</div>
<div id="outline-container-orgb763822" class="outline-3">
<h3 id="orgb763822"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> 加密usb耳麦</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>支持设置密钥，使用相同密钥的usb耳麦可以实时对话</li>
<li>通过对语音加密和调制，输出加密语音</li>
<li>对收到的语音进行解调和解密，输出原语音</li>
</ul>
</div>
</div>
<div id="outline-container-org8aaeec4" class="outline-3">
<h3 id="org8aaeec4"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> 开源随身移动存储设备</h3>
</div>
</div>
<div id="outline-container-org9e2d7c1" class="outline-2">
<h2 id="org9e2d7c1"><span class="section-number-2">2.</span> 开源软件</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org75933de" class="outline-3">
<h3 id="org75933de"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> 安全匿名交换网络</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>基于gossip通讯，无中心的信息交换网络</li>
<li>信息匿名，无法追踪</li>
</ul>
</div>
</div>
<div id="outline-container-org80149ba" class="outline-3">
<h3 id="org80149ba"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> 基于块设备的TableFS(内核文件系统)</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>通过KV技术优化元数据操作</li>
<li>通过负载感知技术，动态调整索引结构</li>
<li>应用最新的索引技术:surf/learned index/B-trie/hybrid index</li>
</ul>
</div>
</div>
<div id="outline-container-orgbcb9cb3" class="outline-3">
<h3 id="orgbcb9cb3"><span class="section-number-3">2.3.</span> <span class="todo TODO">TODO</span> 基于公有云的安全存储系统</h3>
</div>
</div>
<div id="outline-container-org525331d" class="outline-2">
<h2 id="org525331d"><span class="section-number-2">3.</span> 学习</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc812d03" class="outline-3">
<h3 id="orgc812d03"><span class="section-number-3">3.1.</span> <span class="done DONE">DONE</span> 雅思考试</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>学习羊驼雅思</li>
<li>确认口语考试时间</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeabab8e" class="outline-2">
<h2 id="orgeabab8e"><span class="section-number-2">4.</span> 读书</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf25c51b" class="outline-3">
<h3 id="orgf25c51b"><span class="section-number-3">4.1.</span> <span class="todo TODO">TODO</span> 九型人格</h3>
</div>
<div id="outline-container-org79aeedf" class="outline-3">
<h3 id="org79aeedf"><span class="section-number-3">4.2.</span> <span class="todo TODO">TODO</span> rust语言编程</h3>
</div>
</div>
